module.exports = {
    keyboards: {
        menu: {
            availableTasks: 'Доступные задания',
            checkBalance: 'Проверить баланс',
            buyPoints: 'Купить очки'
        }
    },


    reply: {
        commands: {
            help: 
            `Команды:
        🔴/start — зарегистрироваться заново,
        🔴/menu — показать главное меню,
        🔴/notifications — включить / выключить оповещения о новых заданиях.`,

            notifications: {
                on: `Оповещения о новых заданиях активированы!
                Чтобы отключить их, введите команду /notifications`,
                off: `Вы больше не будете получать оповещения о новых заданиях!
                Чтобы активировать их, введите команду /notifications`
            },

            menu: `Меню`
        }
    },





    similarLanguages: ['uk']
}